Tekla Open API Reference for Tekla Structures 2025
LoftedPlate.FaceType Property
 Gets or sets what type of solid faces will be used to create lofted plate solid.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LoftedPlate.LoftedPlateFaceTypeEnum FaceType { get; set; }
Public Property FaceType As LoftedPlate.LoftedPlateFaceTypeEnum
	Get
	Set
Property Value
Type: LoftedPlate.LoftedPlateFaceTypeEnum
See Also
Reference
LoftedPlate Class
Tekla.Structures.Model Namespace